Display

Head()

head() will display the default top to 5th rows values. head(n) it will display from top to nth rows

Tail()

tail() this will display the default 5 rows from the bottom.tail(n) it will print from bottom to nth rows.

In [14]:
import pandas as pd 
df=pd.read_csv(r"C:\Users\ashay\OneDrive\Desktop\SACRIFICES OF COMFORT\Machine-Learning\Speedrun For MidTerm Exam\.venv\Workable\titanic_tested.csv")
#head
print("Display the 5 rows of the top")
df.head()# to the default 5 rows 
print("Display the 2 rows from the top")
df.head(2) #to the nth rows
# #tail
print("Display the bottome 5 rows")
df.tail()
print("Display the 3 from the bottom")
df.tail(3)

Display the 5 rows of the top
Display the 2 rows from the top
Display the bottome 5 rows
Display the 3 from the bottom

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C